/*************************************************************************************************
 * * 250315
 * * 问题总结
 * 1、自动程序 优化问题，照搬不过来， 比如提颈动作，需要总体的思路，需要时间体验按摩椅。
 * 2、功能问题 与手控传输模式重新定义、接收手控器自定义模式、i云APP
 * 3、以下为bug
 * 4、手动下机芯调节不到位、位置显示不准
 * 5、出现 上下机芯不动作
 * 6、出现 手动程序小腿揉捏不工作   //TODO 解决 massageinit.c  MassMode 中修改预设值 小腿揉搓速度
 * 7、手控串口接收问题
 * * 8、手控器100ms 可能会收不到 手控需要回传
 * 
 * 时间节点 391S-6 390单机芯样机
 * 
 * * 250312
 * 不能设置运行圈数，动作不够细致， 都是漏洞
 * 需要计算每个动作，每种速度，需要的时间，尽量弥补
 * 但延时问题，会导致计算出错
 * 
 * todo 尝试圈数控制
 * 
 * * 250309
 * 3D强度控制全部换成 nBackIntensity  250309
 * 
 * A391S问题点：
 * 1.声控调到最大沙哑  -->暂时没解决
 * 2.自动程序 8.17.18.19.没有语音播报  -->没有这些语音播报，更改成，手控器按自动程序不播语音播报。
 * 3.4D强度3档到5档.5档到3档机械手没有变化 . -->自动程序 揉捏颈部时，3D调整较小，因为顶出太多，揉捏不舒服。
 * 4.20个自动模式都有背景音乐  -->自动模式1-5 会触发背景音乐，但背景音乐打开后，切换到其他自动模式或手动 背景音乐都不会关闭，只有关闭背景音乐才能关闭。
 * 5.健康检查不工作--> 需要调试，看是健康模块问题，还是程序问题。  
 * 
 * * 250307
 * * 3D强度存储 有问题，需要区分 自动3D强度 与 控制3D强度 //已经解决
 * * 暂停恢复 气压强度存储问题，主要是气压模式需要重载 //已经解决
 * @ 蓝牙关闭、开始声音
 * * 结束是否直立 bug，  可能是小腿防夹触发 可能是小腿伸缩不到位
 * * 故障表...
 * *小腿 手动上升下降 bug
 * @ A390S LED能不能调暗 是不是硬件pwm
 * @ 增加推拿、PDB2动作 修改ZYS动作 等
 * @ 368 肩颈 的动作可以借鉴
 * 391S-5 和 391S-1 相同
 * *体型检测 停住了  可能还是因为 防夹误触发的问题 小腿没有缩回完成
 * 固件版本号
 * ?蓝牙名称问题
 * @ 391呼吸灯 390扶手灯pwm
 * * 4D强度调整  按摩强度是什么？  * 轻柔、舒适、强劲 代表 4D强度 与 气压强度一起配置 需要完善  完成
 * * 声控功能未完善
 * !与手控器通信，偶尔会收不到全包，现象为上下行按键抬起，没有停止
 * todo 机芯老化工装 待验证
 * todo 老化电动杆停止 测试是8804芯片保护，写了缓冲程序 待确定 暂时没问题
 * 
 * *250305
 * 语音播报 bug  不停播放0 启用单曲循环 暂时避免
 * 加热片控制 已经 开3分钟 停1分钟
 * * 手动时气压读表有问题 等手动开启 通过延时打补丁方式暂时解决
 * 
 * * 250227
 * 没有连续报警声音  已有
 * 健康指数对应自动程序 待ui完善
 * 配置在 SysCfg.h
 * 零重力问题 在于 AT表中 DDG_Set_Stop  nCurZeroState = 0x80; //todo test1
 * 
 * * * 250223 累计问题
 * @ 蓝牙关闭、开始声音
 * * 结束是否直立 bug，  可能是小腿防夹触发 可能是小腿伸缩不到位
 * *故障表...
 * *小腿 手动上升下降 bug
 * @ A390S LED能不能调暗 是不是硬件pwm
 * @ 增加推拿、PDB2动作 修改ZYS动作 等
 * @ 368 肩颈 的动作可以借鉴
 * 391S-5 和 391S-1 相同
 * 体型检测 停住了  可能还是因为 防夹误触发的问题 小腿没有缩回
 * 固件版本号
 * ?蓝牙名称问题
 * @ 391  呼吸灯
 * @ 4D强度调整  按摩强度是什么？  * 轻柔、舒适、强劲 代表 4D强度 与 气压强度一起配置 需要完善
 * * 声控功能未完善
 * !与手控器通信，偶尔会收不到全包，现象为上下行按键抬起，没有停止
 * *机芯老化工装
 * @老化电动杆停止 测试是8804芯片保护，写了缓冲程序 待确定
 * 局部按摩不行 王工已经解决 * 
 * *开机时，小腿防夹有问题，   仿真器问题
 * 体型检测 超出 王工解决
 * 
 * 等待时间100ms 会跳过改条指令  已调整等待500ms 后面需要再完善
 * 小腿防夹灵敏度调试 王工已完成
 * 双机芯碰撞，待老化测试 软件碰撞 已经完成
 *! ZY 手法变化宽度，没有走最短路径  不能用最短路径 * 
 * *无自定义功能
 * 小腿上下时，定义反向 * 
 * 
 * 
 *  * 250222 累计问题 
 * 收藏 手动程序 完成
 * 机芯老化工装
 * 老化电动杆停止
 * 局部按摩不行
 * 蓝牙名称问题
 * 开机时，小腿防夹有问题，需要一点时间
 * 关机不复位，重新开机有问题， 开机复位问题
 * D3RNZ 时间都是 60秒  修改AT.c 不判断 顶出=3 
 * 体型检测 超出
 * 手动时气压读表有问题 等手动开启
 * 等待时间100ms 会跳过改条指令  已调整等待500ms 后面需要再完善
 * 小腿防夹灵敏度调试
 * 自动找脚功能缺失
 * 双机芯碰撞，待老化测试
 *! ZY 手法变化宽度，没有走最短路径  不能用最短路径
 * 与手控器通信，偶尔会收不到全包，现象为上下行按键抬起，没有停止
 * 无自定义功能
 * 声控功能只未完善，只打通 轻松按摩 没有打开气压
 * 用户存储 没有保存气压
 * 语音播报，背景音乐播报异常，原来能播放第一首，待调试
 * 正式老化程序出错
 * 
 * @ 声音更新在 MassageUpdate
 * 
 * * 250217
 * RollSpeedSet
 * 串口接收不完全
 * USART0_IRQHandler //todo 注意区别
 * 
 * * 250215
 * 	if (MChair.CFG.Bit.CoreReset) 上下机芯复位
 *  CoreRest();
 *  nBackIntensity = nBackIntensity; //todo 注意机芯强度 调节
 *  MassIntensitySet(nBackIntensity);
 * void VoiceControl_Handler(void) 声控程序
 * 音乐播放
 *
 * * 250210
 * Get_M1_M2_AntiFlag  上下机芯间隔计算
 *
 * * 250207
 * AirTable 参数
 * SpikeAutoAction
 * AT_Table[3] 下机芯表
 * AT_Table[5] 气压表
 * AT_Table[5].TableStep 气压表
 *
 * * 250126
 * cmd_p->TableStep 步数
 * 修改__packet RO_data 7226-->7780
 *
 * * 250124
 * todo 调试问题，蓝牙名字还不正确
 * todo 语音识别不行
 * todo 手动模式不能存储、存储气压模式不对
 *
 * * 250123
 * 修改原A390样机程序问题，气压按摩无法关闭、强度调节没有提示音
 * 按摩速度调节没有提示音，宽度档位没法调到1档
 * 滚轮调节没有提示音等
 * todo 修改关机复位过程，不能开机问题，待测试
 * * 修改后背加热IO设置，增加关机关闭加热开关 普通方法无效 修改后有效
 * * 手动模式，上下半身，下发到机芯控制
 * * 调试存储
 *
 *
 * * 250122
 * RxVar1 485—1
 * _485ComRx 485接收函数 while(1) 中循环
 * A390_Handler 扶手按键处理
 *
 * * 250121
 * 调整程序格式，适合vscode
 * 修改 自动程序全气压 FA_GAS_FULLGAS
 *
 * * 250118
 * 接手A390S,从单机芯开始 不行 程序不一样
 * * #define __packed __attribute__((packed)) // todo test 无效
 *
 *
==================================================================================================*/
