/*************************************************************************************************
 * 
 * 
 * 
 * * 260616
 * Handle_Dispaly_Step = 0; // * todo 增加防止断电5秒内上电手控器bug 260616 
 * 
 * * 260613
 * Move_Flag[MoveUp].Area = 0xff; // *  遇到 手动全局暂停、恢复，不能继续全局的问题
 * 
 * * 260605
 * 增加 小腿计数滤波
 * 
 * * 260511
 * @ 吸收 391S-5 吸收 S0551
 * @ 不合适吸收 双J28 J0201上机芯
 * 
 * * 260511
 * @ 吸收 390S-33 S0555 和 395S-2 内容
 * 
 * * 260509
 * 修改轻柔 强劲 默认气压值
 * 
 * * 260319
 * 1、391S-32 修改增加躺倒播报语音 
 * 
 * * 260119
 * 1、总裁 揉捏拍打加速 
 * 
 * * 260107
 * 1、修改压肩方式
 * 
 * * 251218
 * 1、修改485通讯bug
 * 2、修改结束气压bug
 * 
 * * 250924
 * 默认设置
 * 1、手动上机芯全身、下机芯下限位不能升降
 * 2、扶手按键 手法切换、区域切换 只针对上机芯
 * 3、手动转自动时，界面自动切换成上机芯内容
 * 4、切换自动程序时，加载是否加热预设定，与切换前是否加热无关
 * 5、自动程序直接切换到下机芯，会先显示上机芯内容
 * 5.1、已切换到下机芯界面，点主页，再调节3D强度，会切回上机芯，并调节上机芯3D强度
 * 6、出厂恢复不改变自定义手法
 * 7、关机15秒之后状态 扶手旋钮可以调节角度、但没有蜂鸣器声音，也不会自动找脚
 * 7.1、关机15秒之后状态 充电不工作
 * 8、左右充气时 图标一起显示，左右手充气图标是一体的
 * 9、体型检测后，肩位调节时 机械手图标固定在肩位
 * 10、 蓝牙音乐 优先于 背景音乐
 * 11、自动、手动模式之间切换 倒计时重新计时
 * 12、按摩强度（轻柔、舒缓、强劲） 默认舒缓，轻柔3D和气压强度-1档，强劲+1档
 * 13、自动程序运行时、手动调节界面区域显示“定点”或不显示
 * 
 * 
 * 修改
 * 1、旋钮上限位 找脚
 * 2、旋钮上限位 声音
 * 3、机芯碰撞、上机芯局部 卡死bug
 * 4、扶手旋钮触地 改成同 手控按钮触地
 * * 5、健康检测 顶出收回 未完成 --> 完成 
 * * 6、语音识别6S内，继续响应 优化一点 优化不了 251218
 * 
 * *问题
 * * 1、重复开关机复位会漏掉步骤 修改需测试250925 解决
 * * 2、关机复位最后会合拢 修改250925 解决
 * * 3、指压1档没有升降 解决
 * * 4、健康检测失败、点主页，需要一段时间才能恢复自动程序
 * 
 * * 250913
 * 逻辑优先级  故障>手动>常规>自动
 *
 *
 *
 * * 250703 质检问题点：
 * 1、左扶手未充气，右扶手在充气，手控器充气图标左右扶手都是点亮状态，相反右不充，左充，图标一致点亮
 * 2、升降旋钮偏紧不顺畅
 * 3、快捷键声控喇叭按键不工作
 * 4、小腿不升降
 * 5、关机不复位
 * *250703 质检问题点回复：
 * 1、左右手图标图片是一个图，没法分开
 * 2、
 * 3、可能是扶手与主板通讯线连接松动，插紧后未复现
 * 4、可能是小腿与主板通讯线连接松动，但模拟出来的现象与品质试出来的现象有些不同，需继续测试、分析
 * 5、小腿不升降时，关机无法复位


 *  * 250619   391 质检问题点：
 * 1.肩位检测时，机械手位置不准确， ----> 王工调试
 * 2.肩位检测时调节到极限蜂鸣声错误，  ---> 报警声与提示音接近，但有不同。
 * 3.手动小腿缩回来到极限蜂鸣声错误。 ----> 王工调试 小腿伸缩电机电流异常。
 * 4.升降时靠背磨皮异响严重.
 * 5.扶手旋转按钮升降时不灵敏.  ----> 旋钮需要拧两小格才能触发运行。
 * 6.开机LG错误，越南语出现中文 （艾力斯特）
 *
 * 备注问题：
 * 1、下周A391 要认证,到时会没有样机
 * 2、A390 小腿没有揉搓和热疗
 * 3、
 *
 *
 * * 250618 390S/391S 修改内容
 * 1、增加 usermode=1 辅助开机复位 CurCircle != 2
 * 2、修改触地 小腿下降停止条件 Leg_Touch_Flag && (DDG_Get_LnCurCircle > 20)
 *
 *
 * * 250613 390S/391S 修改内容
 * 1、修改下机芯 腰部动作 增加 PYH3
 *
 *
 * * 250612 390S/391S 修改内容
 * 1、修改小腿升降速度 LDDG_SPEED
 * 2、修改拉伸触地不回缩 STETCHGAS_Touch_Flag
 * 3、Leg_Touch_Flag    Leg_Touch_Air_Flag 触地回缩 脚部不充气
 * 4、修改小腿拉伸 气压模式 air.c table.c 小腿拉伸不再由气压表决定
 *
 * * 250609 390S/391S 修改内容
 * 1、修改减少时间按键 少于5分钟问题
 * 2、修改调用存储、自定义 手动全身、局部时，APP按摩区域显示不对问题
 *
 * * 250608 390S/391S 修改内容
 * 1、增加蓝牙配对密码
 *
 * * 250604 G7-101
 * 1、修改小腿拉伸 全身拉伸 气压强度
 * 2、修改自动找脚，关闭小腿气压
 *
 * * 250604 390S/391S 修改内容
 * 1、修改老化程序速度
 * 2、编写机械手安装上导轨工装程序
 * 3、屏蔽机械手计数故障代码
 * 4、同390S-1减轻气压
 *
 * * 250530 390S/391S 修改内容
 * 1、修改气压舒适度
 * 2、修改零压舒展 气压与机芯 时间同步
 *
 * * 250527 390S/391S 修改内容
 * 1、修改气泵全开程序
 *
 * * 250519 390S/391S 修改内容
 * 1、修改肩位调节12档
 *
 * * 250512 390S/391S 修改内容
 * 1、上机芯全身、下身、上身时，下机芯行动受限
 * 2、扶手切换手动程序和部位时，自动转成上机芯 -->待验证
 *
 * * 250510 390S/391S 修改内容
 * 1、修复暂停还会动bug
 * 2、增加碰撞缓冲区 140+30->140+50 另外泰式拉筋不受影响 改动4处 movemagic moveup movedw at
 *
 *
 * * 250504 390S/391S 修改内容
 * 1、删除零压舒展压肩动作 替换成推拿颈部
 * 2、修改靠背加热
 * 3、修改小腿拉伸和找脚逻辑
 *
 *
 * * 250428 390S/391S 修改内容
 * 1、蓝牙名称 IMCM-XXXXXXYYYY
 * 2、修改手动全身时，下机芯走到底部
 * 3、健康检测推荐程序时、显示推荐程序
 * 4、修改语音识别自动程序后、按其他自动程序，重新运行语音识别程序bug
 * 5、零重力复位时、要求先缩小腿 ---- 未完成
 * 6、固件更新 CRC校验  ---- 未完成
 * 7、待机时、推杆运动不找脚
 *
 *
 * * 250425
 * 1、增加手动全身、下身时、下机芯走到底功能
 *
 * * 250417  * 样机390S-2问题点：
 * 1.   4D揉捏异响.
 * 2.下机芯宽度调节3档到4档  .4档到5档 不是很明显  -------> 王工在调试
 * 3.下机芯拍打宽度调节机械手没反应， -------> 王工在调试
 * 4.没有语音包，声控无法验   ------------> 暂时没有语音包，只有词条文档
 * 5.升降时.右肩上面异响严重，
 * 6.设置界面调成不复位，按摩时间结束，手控器不黑屏，时间回到20分钟，显示无手法，LDD灯也不熄灭.   -------> 特意要求不息屏，进入空闲状态，点击自动、手动程序会退出此状态，空闲状态LED灯关闭(在修改)
 *
 *
 *
 * * 250415
 * usermode 1->0 导致故障代码错误生成 D9 A8 等 已屏蔽
 *
 * * 250412  * 391S-1问题点：
 * 7.蓝牙开启无提示语，只有提示音 --------> 关闭了蓝牙开启、关闭  提示语
 * 6.快捷键不工作 -------->没有复现------>可能是按 “手动模式切换” 按键下方不灵敏
 * 2.语音声控坐姿下降回答坐姿上升， ----------> 坐姿上升、下降会播报两次，已经修改
 * 4.APP按声控键没反应  ----------> 已增加APP 唤醒键功能 --->声控开关已开的情况下，按唤醒键，唤醒声控，并播报“请说指令”
 *
 * 5.体型检测过程中机芯不动  一直停在检测检测页面  .及时点击暂停，体型检测页面也会持续在跳动  -------> 机芯通讯不上
 * 10.人形图标屁股两个OO是什么意思，需要与机芯位置同步，技术没有确认  -------> 机芯通讯不上 位置采集失败
 * 13.机芯定点上下调节不动                             -------> 机芯通讯不上
 * 14.按摩结束后.机芯也不复位，显示屏显示页面停留太长.   -------> 机芯通讯不上，机芯不复位，需要等60s强制关机
 * ---------->5、10、13、14 应该是机芯更新了程序，没有重启机芯，机芯通讯错误 老化模式显示故障码 0xA0
 *
 * 8.复位键触按无颜色提示，
 * 11.返回主页面太麻烦，要点两次
 * 12.机芯定点按摩太麻烦  要点两次
 *
 * 3.机械手异响
 * 9.下机芯拍打异响
 *
 * 其他问题
 * 1.设置界面关闭蓝牙背景音乐也会关闭几秒，  ----------> 已修改
 * 15、有一些手机 登录irest云APP 搜索不到按摩椅 --------> 平台方面说要查看APP版本 目前最新版本2.3.1 ---------->另外要确保蓝牙打开
 * 16、在线自动程序 添加和删除 功能没有实现
 * 17、固件升级功能 还存在问题
 * 18、APP 蓝牙开启 不能显示关闭
 * 19、上机芯开机复位问题
 *
 *
 * * 250410
 * * 1 小腿避让功能 暂无
 * * 2 APP 更新失败
 * * 3 自动程序 体验感 prevent 碰撞等
 * * 4、蓝牙关闭 背景音乐停播15s  ------> 需要优化
 * * 5、蓝牙名称 A1XXXXXXYYYY  --> DM6-XXXXXXYYYY
 *
 * * 250408  A390S-2 样机问题
 * 1、声控唤醒后回复指令错误 ------> 声控，更改中文版 VT100MOD-2.0 FI(中文) VT100-A550 语音词条  蓝牙模块下载 A391S-1MUSIC 文件
 * 2、关机页面显示太长  ------> 小腿回缩没有到位引起
 * 3、升降旋钮 不符 ------> 不知扶手按键程序是否更新 需要调试看看
 * 4、扶手按键不符  ------> 需要调试看看
 * 5、童锁锁不住快捷按键  ------> 目前版本 锁不住
 * 6、左扶手彩灯不亮 ------> 查看接线
 * 7、蓝牙关闭 背景音乐停播15s  ------> 需要优化
 * 8、背部热疗太烫 ------> 原来 加3分钟停1分钟 改为  加3分钟停1分钟 后续 加2分钟停2分钟
 * 9、足底滚轮、小腿揉搓、滚刮不工作  ------> 王工已处理 接线问题
 * 10、11、14  都是小腿问题  ------> 王工已处理 接线问题
 * 12、主页面只能显示上下机芯中的一个的  ------>  目前版本只能显示 一个
 * 13、按摩强度调节，气压灯？，  ------> 按摩强度(轻柔、舒缓、强劲) 控制4D强度和气压强度，控制完后可单独再加减4D强度和气压强度
 * 15、蓝牙名称与命名不符  ------> 已修改成 IMCM-XXXXXXYYYY
 * 16、手控无健康检测 ------>  更新 手控程序 390S-2
 *
 * * 250315
 * * 问题总结
 * 1、自动程序 优化问题，照搬不过来， 比如提颈动作，需要总体的思路，需要时间体验按摩椅。
 * 2、功能问题 与手控传输模式重新定义、接收手控器自定义模式、i云APP
 * 3、以下为bug
 * 4、手动下机芯调节不到位、位置显示不准
 * 5、出现 上下机芯不动作
 * 6、出现 手动程序小腿揉捏不工作   //@ 解决 massageinit.c  MassMode 中修改预设值 小腿揉搓速度
 * 7、手控串口接收问题
 * * 8、手控器100ms 可能会收不到 手控需要回传
 *
 * 时间节点 391S-6 390单机芯样机
 *
 * * 250312
 * 不能设置运行圈数，动作不够细致， 都是漏洞
 * 需要计算每个动作，每种速度，需要的时间，尽量弥补
 * 但延时问题，会导致计算出错
 *
 * @ 尝试圈数控制
 *
 * * 250309
 * 3D强度控制全部换成 nBackIntensity  250309
 *
 * A391S问题点：
 * 1.声控调到最大沙哑  -->暂时没解决
 * 2.自动程序 8.17.18.19.没有语音播报  -->没有这些语音播报，更改成，手控器按自动程序不播语音播报。
 * 3.4D强度3档到5档.5档到3档机械手没有变化 . -->自动程序 揉捏颈部时，3D调整较小，因为顶出太多，揉捏不舒服。
 * 4.20个自动模式都有背景音乐  -->自动模式1-5 会触发背景音乐，但背景音乐打开后，切换到其他自动模式或手动 背景音乐都不会关闭，只有关闭背景音乐才能关闭。
 * 5.健康检查不工作--> 需要调试，看是健康模块问题，还是程序问题。
 *
 * * 250307
 * * 3D强度存储 有问题，需要区分 自动3D强度 与 控制3D强度 //已经解决
 * * 暂停恢复 气压强度存储问题，主要是气压模式需要重载 //已经解决
 * @ 蓝牙关闭、开始声音
 * * 结束是否直立 bug，  可能是小腿防夹触发 可能是小腿伸缩不到位
 * * 故障表...
 * *小腿 手动上升下降 bug
 * @ A390S LED能不能调暗 是不是硬件pwm
 * @ 增加推拿、PDB2动作 修改ZYS动作 等
 * @ 368 肩颈 的动作可以借鉴
 * 391S-5 和 391S-1 相同
 * *体型检测 停住了  可能还是因为 防夹误触发的问题 小腿没有缩回完成
 * 固件版本号
 * ?蓝牙名称问题
 * @ 391呼吸灯 390扶手灯pwm
 * * 4D强度调整  按摩强度是什么？  * 轻柔、舒适、强劲 代表 4D强度 与 气压强度一起配置 需要完善  完成
 * * 声控功能未完善
 * !与手控器通信，偶尔会收不到全包，现象为上下行按键抬起，没有停止
 * @ 机芯老化工装 待验证
 * @ 老化电动杆停止 测试是8804芯片保护，写了缓冲程序 待确定 暂时没问题
 *
 * *250305
 * 语音播报 bug  不停播放0 启用单曲循环 暂时避免
 * 加热片控制 已经 开3分钟 停1分钟
 * * 手动时气压读表有问题 等手动开启 通过延时打补丁方式暂时解决
 *
 * * 250227
 * 没有连续报警声音  已有
 * 健康指数对应自动程序 待ui完善
 * 配置在 SysCfg.h
 * 零重力问题 在于 AT表中 DDG_Set_Stop  nCurZeroState = 0x80; //@ test1
 *
 * * * 250223 累计问题
 * @ 蓝牙关闭、开始声音
 * * 结束是否直立 bug，  可能是小腿防夹触发 可能是小腿伸缩不到位
 * *故障表...
 * *小腿 手动上升下降 bug
 * @ A390S LED能不能调暗 是不是硬件pwm
 * @ 增加推拿、PDB2动作 修改ZYS动作 等
 * @ 368 肩颈 的动作可以借鉴
 * 391S-5 和 391S-1 相同
 * 体型检测 停住了  可能还是因为 防夹误触发的问题 小腿没有缩回
 * 固件版本号
 * ?蓝牙名称问题
 * @ 391  呼吸灯
 * @ 4D强度调整  按摩强度是什么？  * 轻柔、舒适、强劲 代表 4D强度 与 气压强度一起配置 需要完善
 * * 声控功能未完善
 * !与手控器通信，偶尔会收不到全包，现象为上下行按键抬起，没有停止
 * *机芯老化工装
 * @老化电动杆停止 测试是8804芯片保护，写了缓冲程序 待确定
 * 局部按摩不行 王工已经解决 *
 * *开机时，小腿防夹有问题，   仿真器问题
 * 体型检测 超出 王工解决
 *
 * 等待时间100ms 会跳过改条指令  已调整等待500ms 后面需要再完善
 * 小腿防夹灵敏度调试 王工已完成
 * 双机芯碰撞，待老化测试 软件碰撞 已经完成
 *! ZY 手法变化宽度，没有走最短路径  不能用最短路径 *
 * *无自定义功能
 * 小腿上下时，定义反向 *
 *
 *
 *  * 250222 累计问题
 * 收藏 手动程序 完成
 * 机芯老化工装
 * 老化电动杆停止
 * 局部按摩不行
 * 蓝牙名称问题
 * 开机时，小腿防夹有问题，需要一点时间
 * 关机不复位，重新开机有问题， 开机复位问题
 * D3RNZ 时间都是 60秒  修改AT.c 不判断 顶出=3
 * 体型检测 超出
 * 手动时气压读表有问题 等手动开启
 * 等待时间100ms 会跳过改条指令  已调整等待500ms 后面需要再完善
 * 小腿防夹灵敏度调试
 * 自动找脚功能缺失
 * 双机芯碰撞，待老化测试
 *! ZY 手法变化宽度，没有走最短路径  不能用最短路径
 * 与手控器通信，偶尔会收不到全包，现象为上下行按键抬起，没有停止
 * 无自定义功能
 * 声控功能只未完善，只打通 轻松按摩 没有打开气压
 * 用户存储 没有保存气压
 * 语音播报，背景音乐播报异常，原来能播放第一首，待调试
 * 正式老化程序出错
 *
 * @ 声音更新在 MassageUpdate
 *
 * * 250217
 * RollSpeedSet
 * 串口接收不完全
 * USART0_IRQHandler //@ 注意区别
 *
 * * 250215
 * 	if (MChair.CFG.Bit.CoreReset) 上下机芯复位
 *  CoreRest();
 *  nBackIntensity = nBackIntensity; //@ 注意机芯强度 调节
 *  MassIntensitySet(nBackIntensity);
 * void VoiceControl_Handler(void) 声控程序
 * 音乐播放
 *
 * * 250210
 * Get_M1_M2_AntiFlag  上下机芯间隔计算
 *
 * * 250207
 * AirTable 参数
 * SpikeAutoAction
 * AT_Table[3] 下机芯表
 * AT_Table[5] 气压表
 * AT_Table[5].TableStep 气压表
 *
 * * 250126
 * cmd_p->TableStep 步数
 * 修改__packet RO_data 7226-->7780
 *
 * * 250124
 * @ 调试问题，蓝牙名字还不正确
 * @ 语音识别不行
 * @ 手动模式不能存储、存储气压模式不对
 *
 * * 250123
 * 修改原A390样机程序问题，气压按摩无法关闭、强度调节没有提示音
 * 按摩速度调节没有提示音，宽度档位没法调到1档
 * 滚轮调节没有提示音等
 * @ 修改关机复位过程，不能开机问题，待测试
 * * 修改后背加热IO设置，增加关机关闭加热开关 普通方法无效 修改后有效
 * * 手动模式，上下半身，下发到机芯控制
 * * 调试存储
 *
 *
 * * 250122
 * RxVar1 485—1
 * _485ComRx 485接收函数 while(1) 中循环
 * A390_Handler 扶手按键处理
 *
 * * 250121
 * 调整程序格式，适合vscode
 * 修改 自动程序全气压 FA_GAS_FULLGAS
 *
 * * 250118
 * 接手A390S,从单机芯开始 不行 程序不一样
 * * #define __packed __attribute__((packed)) // @ test 无效
 *
 *
==================================================================================================*/
